RubyProgramming/RailsProgramming/miniSNS/app/controllers/members_controller.rb

  def index
	if !checklogin? then return end #

    @members = Member.all
---
SELECT "members".* FROM "members"

  def show
	if !checklogin? then return end

	@me = me?
    @member = Member.find(params[:id])

	frs = Friend.where(:member_id => params[:id].to_i)
	frlist = '('
	frs.each do |fr|
		frlist += fr.friend_id.to_s + ','
	end
	frlist += '0)'

	query = "select * from members where id in " + frlist
	@friends = Member.find_by_sql(query)

	@isFr = Friend.where(:member_id => session[:login].id, :friend_id => params[:id].to_i).count > 0
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "friends".* FROM "friends" WHERE "friends"."member_id" = 1
SELECT COUNT(*) FROM "friends" WHERE "friends"."member_id" = 1 AND "friends"."friend_id" = 1

  def edit
	if !checkme? then return end
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	if !checkadmin? then return end
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("admin", "created_at", "mail", "memo", "name", "pass", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def login
  	@msg = "get"
	@member = Member.new

	if request.post? then
		@member = Member.new(params[:member])
		record = Member.find_by_user(params[:member][:user])
---
SELECT "members".* FROM "members" WHERE "members"."user" = 'ueno' LIMIT 1

  def friend
  	if Friend.where(:member_id => session[:login].id, :friend_id => params[:id]).exists? then
		Friend.where(:member_id => session[:login].id, :friend_id => params[:id]).each do |f|
			f.destroy
		end
	else
		Friend.new({:member_id => session[:login].id, :friend_id => params[:id].to_i}).save
---
SELECT "friends".* FROM "friends" WHERE "friends"."member_id" = 1 AND "friends"."friend_id" = 2
SELECT 1 AS one FROM "friends" WHERE "friends"."member_id" = 1 AND "friends"."friend_id" = 2 LIMIT 1
INSERT INTO "friends" ("created_at", "friend_id", "member_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 07:12:01 UTC +00:00], ["friend_id", 2], ["member_id", 1], ["updated_at", Sat, 02 Nov 2013 07:12:01 UTC +00:00]]