RubyProgramming/RailsProgramming/miniSNS/app/controllers/messages_controller.rb

  def index
	if !checklogin? then return end

	page_length = 10 # number of items in a page.
	@page = params.has_key?(:page) ? params[:page].to_i : 1

	friends = Friend.where(:member_id => session[:login].id)
---
SELECT "friends".* FROM "friends" WHERE "friends"."member_id" = 1

  def show
	if !checklogin? then return end

    @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	if !checklogin? then return end

    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("content", "created_at", "member_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "テストだ\r\n"], ["created_at", Sat, 02 Nov 2013 09:27:39 UTC +00:00], ["member_id", 1], ["updated_at", Sat, 02 Nov 2013 09:27:39 UTC +00:00]]

  def comment
  	if request.post? then
		cmt = Comment.new(params[:comment])

		if cmt.save then
---
INSERT INTO "comments" ("content", "created_at", "member_id", "message_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "comment test"], ["created_at", Sat, 02 Nov 2013 09:39:34 UTC +00:00], ["member_id", 1], ["message_id", 2], ["updated_at", Sat, 02 Nov 2013 09:39:34 UTC +00:00]]