RubyProgramming/RailsProgramming/miniSNS/app/views/members/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."member_id" = 1
---
		<td><ul>
		<% @member.message.each do |msg| %>

SELECT "comments".* FROM "comments" WHERE "comments"."member_id" = 1
---
		<td><ul>
		<% @member.comment.each do |cmt| %>