RubyProgramming/RailsProgramming/miniSNS/app/views/messages/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = 1
---
		<ul>
		<% @message.comment.each do |cmt| %>